In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("titanic.csv")
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

1. sibsp - Siblings and spouse count

2. parch - Parent and children count

missing values are found in the columns like age, fare, embark, cabin

embark - port

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1308 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

# Data cleaning

1. Check for duplicates and handle them

2. handle the missing values

3. check for invalid datatypes and handle them

In [5]:
df.duplicated()

# no duplicates present in the dataset

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Length: 1309, dtype: bool

In [6]:
age_median = df['age'].median()

In [7]:
fare_median = df['fare'].median()

In [8]:
df['age'] = df['age'].fillna(age_median)

In [9]:
df['fare'] = df['fare'].fillna(fare_median)

In [10]:
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,28.0000,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

In [11]:
df['embarked'].mode()

0    S
Name: embarked, dtype: object

In [12]:
df['embarked'].mode()[0]

'S'

In [13]:
df['embarked'] = df['embarked'].fillna(df['embarked'].mode()[0])
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,28.0000,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1309 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

In [15]:
df = df.dropna(axis=1)
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S,0
...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,C,0
1305,3,"Zabour, Miss. Thamine",female,28.0000,1,0,2665,14.4542,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,S,0

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   float64
 8   embarked  1309 non-null   object
 9   survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 102.4+ KB

All the columns have valid data type

# Data Transformation (or) Feature Engineering

In [17]:
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S,0
...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,C,0
1305,3,"Zabour, Miss. Thamine",female,28.0000,1,0,2665,14.4542,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,S,0

In [18]:
df = df.rename(columns={"sex": "gender", "embarked":"port"})
df

,pclass,name,gender,age,sibsp,parch,ticket,fare,port,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S,0
...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,C,0
1305,3,"Zabour, Miss. Thamine",female,28.0000,1,0,2665,14.4542,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,S,0

In [19]:
df['pclass'].unique()

array([1, 2, 3])

In [21]:
df['name'].str.split()

0                      [Allen,, Miss., Elisabeth, Walton]
1                     [Allison,, Master., Hudson, Trevor]
2                       [Allison,, Miss., Helen, Loraine]
3              [Allison,, Mr., Hudson, Joshua, Creighton]
4       [Allison,, Mrs., Hudson, J, C, (Bessie, Waldo,...
                              ...
1304                             [Zabour,, Miss., Hileni]
1305                            [Zabour,, Miss., Thamine]
1306                        [Zakarian,, Mr., Mapriededer]
1307                              [Zakarian,, Mr., Ortin]
1308                               [Zimmerman,, Mr., Leo]
Name: name, Length: 1309, dtype: object

In [24]:
df['name'].str.split(",", expand=True)

              0                                        1
0         Allen                   Miss. Elisabeth Walton
1       Allison                    Master. Hudson Trevor
2       Allison                      Miss. Helen Loraine
3       Allison              Mr. Hudson Joshua Creighton
4       Allison   Mrs. Hudson J C (Bessie Waldo Daniels)
...         ...                                      ...
1304     Zabour                             Miss. Hileni
1305     Zabour                            Miss. Thamine
1306   Zakarian                          Mr. Mapriededer
1307   Zakarian                                Mr. Ortin
1308  Zimmerman                                  Mr. Leo

[1309 rows x 2 columns]

In [26]:
df[['lname', 'temp']] = df['name'].str.split(",", expand=True)
df

,pclass,name,gender,age,sibsp,parch,ticket,fare,port,survived,temp,lname
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1,Miss. Elisabeth Walton,Allen
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1,Master. Hudson Trevor,Allison
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0,Miss. Helen Loraine,Allison
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S,0,Mr. Hudson Joshua Creighton,Allison
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S,0,Mrs. Hudson J C (Bessie Waldo Daniels),Allison
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,C,0,Miss. Hileni,Zabour
1305,3,"Zabour, Miss. Thamine",female,28.0000,1,0,2665,14.4542,C,0,Miss. Thamine,Zabour
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,C,0,Mr. Mapriededer,Zakarian
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,C,0,Mr. Ortin,Zakarian
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,S,0,Mr. Leo,Zimmerman

In [32]:
df['temp'].str.split(".", expand=True,n=1)

            0                                   1
0        Miss                    Elisabeth Walton
1      Master                       Hudson Trevor
2        Miss                       Helen Loraine
3          Mr             Hudson Joshua Creighton
4         Mrs   Hudson J C (Bessie Waldo Daniels)
...       ...                                 ...
1304     Miss                              Hileni
1305     Miss                             Thamine
1306       Mr                         Mapriededer
1307       Mr                               Ortin
1308       Mr                                 Leo

[1309 rows x 2 columns]

In [34]:
df[['courtesy_title', 'fname']] = df['temp'].str.split(".", expand=True,n=1)
df

,pclass,name,gender,age,sibsp,parch,ticket,fare,port,survived,temp,lname,courtesy_title,fname
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1,Miss. Elisabeth Walton,Allen,Miss,Elisabeth Walton
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1,Master. Hudson Trevor,Allison,Master,Hudson Trevor
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0,Miss. Helen Loraine,Allison,Miss,Helen Loraine
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S,0,Mr. Hudson Joshua Creighton,Allison,Mr,Hudson Joshua Creighton
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S,0,Mrs. Hudson J C (Bessie Waldo Daniels),Allison,Mrs,Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,C,0,Miss. Hileni,Zabour,Miss,Hileni
1305,3,"Zabour, Miss. Thamine",female,28.0000,1,0,2665,14.4542,C,0,Miss. Thamine,Zabour,Miss,Thamine
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,C,0,Mr. Mapriededer,Zakarian,Mr,Mapriededer
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,C,0,Mr. Ortin,Zakarian,Mr,Ortin
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,S,0,Mr. Leo,Zimmerman,Mr,Leo

In [38]:
df['courtesy_title'] = df['courtesy_title'].str.strip()
df

,pclass,name,gender,age,sibsp,parch,ticket,fare,port,survived,temp,lname,courtesy_title,fname
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1,Miss. Elisabeth Walton,Allen,Miss,Elisabeth Walton
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1,Master. Hudson Trevor,Allison,Master,Hudson Trevor
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0,Miss. Helen Loraine,Allison,Miss,Helen Loraine
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S,0,Mr. Hudson Joshua Creighton,Allison,Mr,Hudson Joshua Creighton
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S,0,Mrs. Hudson J C (Bessie Waldo Daniels),Allison,Mrs,Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,C,0,Miss. Hileni,Zabour,Miss,Hileni
1305,3,"Zabour, Miss. Thamine",female,28.0000,1,0,2665,14.4542,C,0,Miss. Thamine,Zabour,Miss,Thamine
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,C,0,Mr. Mapriededer,Zakarian,Mr,Mapriededer
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,C,0,Mr. Ortin,Zakarian,Mr,Ortin
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,S,0,Mr. Leo,Zimmerman,Mr,Leo

In [39]:
df['fname'] = df['fname'].str.strip()
df['lname'] = df['lname'].str.strip()
df

,pclass,name,gender,age,sibsp,parch,ticket,fare,port,survived,temp,lname,courtesy_title,fname
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1,Miss. Elisabeth Walton,Allen,Miss,Elisabeth Walton
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1,Master. Hudson Trevor,Allison,Master,Hudson Trevor
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0,Miss. Helen Loraine,Allison,Miss,Helen Loraine
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S,0,Mr. Hudson Joshua Creighton,Allison,Mr,Hudson Joshua Creighton
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S,0,Mrs. Hudson J C (Bessie Waldo Daniels),Allison,Mrs,Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,C,0,Miss. Hileni,Zabour,Miss,Hileni
1305,3,"Zabour, Miss. Thamine",female,28.0000,1,0,2665,14.4542,C,0,Miss. Thamine,Zabour,Miss,Thamine
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,C,0,Mr. Mapriededer,Zakarian,Mr,Mapriededer
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,C,0,Mr. Ortin,Zakarian,Mr,Ortin
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,S,0,Mr. Leo,Zimmerman,Mr,Leo

In [42]:
df['gender'] = df['gender'].str.title()
df

,pclass,name,gender,age,sibsp,parch,ticket,fare,port,survived,temp,lname,courtesy_title,fname
0,1,"Allen, Miss. Elisabeth Walton",Female,29.0000,0,0,24160,211.3375,S,1,Miss. Elisabeth Walton,Allen,Miss,Elisabeth Walton
1,1,"Allison, Master. Hudson Trevor",Male,0.9167,1,2,113781,151.5500,S,1,Master. Hudson Trevor,Allison,Master,Hudson Trevor
2,1,"Allison, Miss. Helen Loraine",Female,2.0000,1,2,113781,151.5500,S,0,Miss. Helen Loraine,Allison,Miss,Helen Loraine
3,1,"Allison, Mr. Hudson Joshua Creighton",Male,30.0000,1,2,113781,151.5500,S,0,Mr. Hudson Joshua Creighton,Allison,Mr,Hudson Joshua Creighton
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0000,1,2,113781,151.5500,S,0,Mrs. Hudson J C (Bessie Waldo Daniels),Allison,Mrs,Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",Female,14.5000,1,0,2665,14.4542,C,0,Miss. Hileni,Zabour,Miss,Hileni
1305,3,"Zabour, Miss. Thamine",Female,28.0000,1,0,2665,14.4542,C,0,Miss. Thamine,Zabour,Miss,Thamine
1306,3,"Zakarian, Mr. Mapriededer",Male,26.5000,0,0,2656,7.2250,C,0,Mr. Mapriededer,Zakarian,Mr,Mapriededer
1307,3,"Zakarian, Mr. Ortin",Male,27.0000,0,0,2670,7.2250,C,0,Mr. Ortin,Zakarian,Mr,Ortin
1308,3,"Zimmerman, Mr. Leo",Male,29.0000,0,0,315082,7.8750,S,0,Mr. Leo,Zimmerman,Mr,Leo

In [47]:
df['age'] = df['age'].round(1)
df

,pclass,name,gender,age,sibsp,parch,ticket,fare,port,survived,temp,lname,courtesy_title,fname
0,1,"Allen, Miss. Elisabeth Walton",Female,29.0,0,0,24160,211.3375,S,1,Miss. Elisabeth Walton,Allen,Miss,Elisabeth Walton
1,1,"Allison, Master. Hudson Trevor",Male,0.9,1,2,113781,151.5500,S,1,Master. Hudson Trevor,Allison,Master,Hudson Trevor
2,1,"Allison, Miss. Helen Loraine",Female,2.0,1,2,113781,151.5500,S,0,Miss. Helen Loraine,Allison,Miss,Helen Loraine
3,1,"Allison, Mr. Hudson Joshua Creighton",Male,30.0,1,2,113781,151.5500,S,0,Mr. Hudson Joshua Creighton,Allison,Mr,Hudson Joshua Creighton
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0,1,2,113781,151.5500,S,0,Mrs. Hudson J C (Bessie Waldo Daniels),Allison,Mrs,Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",Female,14.5,1,0,2665,14.4542,C,0,Miss. Hileni,Zabour,Miss,Hileni
1305,3,"Zabour, Miss. Thamine",Female,28.0,1,0,2665,14.4542,C,0,Miss. Thamine,Zabour,Miss,Thamine
1306,3,"Zakarian, Mr. Mapriededer",Male,26.5,0,0,2656,7.2250,C,0,Mr. Mapriededer,Zakarian,Mr,Mapriededer
1307,3,"Zakarian, Mr. Ortin",Male,27.0,0,0,2670,7.2250,C,0,Mr. Ortin,Zakarian,Mr,Ortin
1308,3,"Zimmerman, Mr. Leo",Male,29.0,0,0,315082,7.8750,S,0,Mr. Leo,Zimmerman,Mr,Leo

In [50]:
df['fam_cnt'] = df['sibsp'] + df['parch']
df

,pclass,name,gender,age,sibsp,parch,ticket,fare,port,survived,temp,lname,courtesy_title,fname,fam_cnt
0,1,"Allen, Miss. Elisabeth Walton",Female,29.0,0,0,24160,211.3375,S,1,Miss. Elisabeth Walton,Allen,Miss,Elisabeth Walton,0
1,1,"Allison, Master. Hudson Trevor",Male,0.9,1,2,113781,151.5500,S,1,Master. Hudson Trevor,Allison,Master,Hudson Trevor,3
2,1,"Allison, Miss. Helen Loraine",Female,2.0,1,2,113781,151.5500,S,0,Miss. Helen Loraine,Allison,Miss,Helen Loraine,3
3,1,"Allison, Mr. Hudson Joshua Creighton",Male,30.0,1,2,113781,151.5500,S,0,Mr. Hudson Joshua Creighton,Allison,Mr,Hudson Joshua Creighton,3
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0,1,2,113781,151.5500,S,0,Mrs. Hudson J C (Bessie Waldo Daniels),Allison,Mrs,Hudson J C (Bessie Waldo Daniels),3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",Female,14.5,1,0,2665,14.4542,C,0,Miss. Hileni,Zabour,Miss,Hileni,1
1305,3,"Zabour, Miss. Thamine",Female,28.0,1,0,2665,14.4542,C,0,Miss. Thamine,Zabour,Miss,Thamine,1
1306,3,"Zakarian, Mr. Mapriededer",Male,26.5,0,0,2656,7.2250,C,0,Mr. Mapriededer,Zakarian,Mr,Mapriededer,0
1307,3,"Zakarian, Mr. Ortin",Male,27.0,0,0,2670,7.2250,C,0,Mr. Ortin,Zakarian,Mr,Ortin,0
1308,3,"Zimmerman, Mr. Leo",Male,29.0,0,0,315082,7.8750,S,0,Mr. Leo,Zimmerman,Mr,Leo,0

In [52]:
df = df.sort_values(by='ticket', ascending=True)
df

,pclass,name,gender,age,sibsp,parch,ticket,fare,port,survived,temp,lname,courtesy_title,fname,fam_cnt
67,1,"Cherry, Miss. Gladys",Female,30.0,0,0,110152,86.500,S,1,Miss. Gladys,Cherry,Miss,Gladys,0
245,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",Female,33.0,0,0,110152,86.500,S,1,the Countess. of (Lucy Noel Martha Dyer-Edwards),Rothes,the Countess,of (Lucy Noel Martha Dyer-Edwards),0
195,1,"Maioni, Miss. Roberta",Female,16.0,0,0,110152,86.500,S,1,Miss. Roberta,Maioni,Miss,Roberta,0
289,1,"Taussig, Miss. Ruth",Female,18.0,0,2,110413,79.650,S,1,Miss. Ruth,Taussig,Miss,Ruth,2
291,1,"Taussig, Mrs. Emil (Tillie Mandelbaum)",Female,39.0,1,1,110413,79.650,S,1,Mrs. Emil (Tillie Mandelbaum),Taussig,Mrs,Emil (Tillie Mandelbaum),2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
63,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",Female,47.0,1,0,W.E.P. 5734,61.175,S,1,Mrs. Herbert Fuller (Carrie Constance Toogood),Chaffee,Mrs,Herbert Fuller (Carrie Constance Toogood),1
62,1,"Chaffee, Mr. Herbert Fuller",Male,46.0,1,0,W.E.P. 5734,61.175,S,0,Mr. Herbert Fuller,Chaffee,Mr,Herbert Fuller,1
433,2,"Harris, Mr. Walter",Male,30.0,0,0,W/C 14208,10.500,S,0,Mr. Walter,Harris,Mr,Walter,0
81,1,"Crosby, Capt. Edward Gifford",Male,70.0,1,1,WE/P 5735,71.000,S,0,Capt. Edward Gifford,Crosby,Capt,Edward Gifford,2
82,1,"Crosby, Miss. Harriet R",Female,36.0,0,2,WE/P 5735,71.000,S,1,Miss. Harriet R,Crosby,Miss,Harriet R,2